script/k6-scripts/results/20260619-214734/jwt_false_casbin_false_rl_false_pool_false_iam_profile_update.log
 Container rmqnamesrv Running 
 Container RPA-cadvisor Running 
 Container rmqbroker Running 
 Container RPA-minio Running 
 Container RPA-pgdb Running 
 Container RPA-redis Running 
 Container RPA-prometheus Running 
 Container RPA-app Running 
 Container script-k6-run-80d993505d4a Creating 
 Container script-k6-run-80d993505d4a Created 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/apis/iam_profile_update.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * single_api: 300.00 iterations/s for 1m0s (maxVUs: 150-200, exec: singleApi, gracefulStop: 30s)


running (0m01.0s), 001/150 VUs, 293 complete and 0 interrupted iterations
single_api   [   2% ] 001/150 VUs  0m01.0s/1m0s  300.00 iters/s

running (0m02.0s), 001/150 VUs, 593 complete and 0 interrupted iterations
single_api   [   3% ] 001/150 VUs  0m02.0s/1m0s  300.00 iters/s

running (0m03.0s), 001/150 VUs, 893 complete and 0 interrupted iterations
single_api   [   5% ] 001/150 VUs  0m03.0s/1m0s  300.00 iters/s

running (0m04.0s), 001/150 VUs, 1193 complete and 0 interrupted iterations
single_api   [   7% ] 001/150 VUs  0m04.0s/1m0s  300.00 iters/s

running (0m05.0s), 001/150 VUs, 1493 complete and 0 interrupted iterations
single_api   [   8% ] 001/150 VUs  0m05.0s/1m0s  300.00 iters/s

running (0m06.0s), 001/150 VUs, 1793 complete and 0 interrupted iterations
single_api   [  10% ] 001/150 VUs  0m06.0s/1m0s  300.00 iters/s

running (0m07.0s), 001/150 VUs, 2093 complete and 0 interrupted iterations
single_api   [  12% ] 001/150 VUs  0m07.0s/1m0s  300.00 iters/s

running (0m08.0s), 001/150 VUs, 2393 complete and 0 interrupted iterations
single_api   [  13% ] 001/150 VUs  0m08.0s/1m0s  300.00 iters/s

running (0m09.0s), 001/150 VUs, 2693 complete and 0 interrupted iterations
single_api   [  15% ] 001/150 VUs  0m09.0s/1m0s  300.00 iters/s

running (0m10.0s), 001/150 VUs, 2993 complete and 0 interrupted iterations
single_api   [  17% ] 001/150 VUs  0m10.0s/1m0s  300.00 iters/s

running (0m11.0s), 001/150 VUs, 3293 complete and 0 interrupted iterations
single_api   [  18% ] 001/150 VUs  0m11.0s/1m0s  300.00 iters/s

running (0m12.0s), 001/150 VUs, 3593 complete and 0 interrupted iterations
single_api   [  20% ] 001/150 VUs  0m12.0s/1m0s  300.00 iters/s

running (0m13.0s), 001/150 VUs, 3893 complete and 0 interrupted iterations
single_api   [  22% ] 001/150 VUs  0m13.0s/1m0s  300.00 iters/s

running (0m14.0s), 001/150 VUs, 4193 complete and 0 interrupted iterations
single_api   [  23% ] 001/150 VUs  0m14.0s/1m0s  300.00 iters/s

running (0m15.0s), 001/150 VUs, 4493 complete and 0 interrupted iterations
single_api   [  25% ] 001/150 VUs  0m15.0s/1m0s  300.00 iters/s

running (0m16.0s), 001/150 VUs, 4793 complete and 0 interrupted iterations
single_api   [  27% ] 001/150 VUs  0m16.0s/1m0s  300.00 iters/s

running (0m17.0s), 001/150 VUs, 5093 complete and 0 interrupted iterations
single_api   [  28% ] 001/150 VUs  0m17.0s/1m0s  300.00 iters/s

running (0m18.0s), 001/150 VUs, 5393 complete and 0 interrupted iterations
single_api   [  30% ] 001/150 VUs  0m18.0s/1m0s  300.00 iters/s

running (0m19.0s), 001/150 VUs, 5693 complete and 0 interrupted iterations
single_api   [  32% ] 001/150 VUs  0m19.0s/1m0s  300.00 iters/s

running (0m20.0s), 001/150 VUs, 5993 complete and 0 interrupted iterations
single_api   [  33% ] 001/150 VUs  0m20.0s/1m0s  300.00 iters/s

running (0m21.0s), 002/150 VUs, 6292 complete and 0 interrupted iterations
single_api   [  35% ] 002/150 VUs  0m21.0s/1m0s  300.00 iters/s

running (0m22.0s), 001/150 VUs, 6593 complete and 0 interrupted iterations
single_api   [  37% ] 001/150 VUs  0m22.0s/1m0s  300.00 iters/s

running (0m23.0s), 001/150 VUs, 6893 complete and 0 interrupted iterations
single_api   [  38% ] 001/150 VUs  0m23.0s/1m0s  300.00 iters/s

running (0m24.0s), 001/150 VUs, 7193 complete and 0 interrupted iterations
single_api   [  40% ] 001/150 VUs  0m24.0s/1m0s  300.00 iters/s

running (0m25.0s), 001/150 VUs, 7493 complete and 0 interrupted iterations
single_api   [  42% ] 001/150 VUs  0m25.0s/1m0s  300.00 iters/s

running (0m26.0s), 001/150 VUs, 7793 complete and 0 interrupted iterations
single_api   [  43% ] 001/150 VUs  0m26.0s/1m0s  300.00 iters/s

running (0m27.0s), 001/150 VUs, 8093 complete and 0 interrupted iterations
single_api   [  45% ] 001/150 VUs  0m27.0s/1m0s  300.00 iters/s

running (0m28.0s), 001/150 VUs, 8393 complete and 0 interrupted iterations
single_api   [  47% ] 001/150 VUs  0m28.0s/1m0s  300.00 iters/s

running (0m29.0s), 001/150 VUs, 8693 complete and 0 interrupted iterations
single_api   [  48% ] 001/150 VUs  0m29.0s/1m0s  300.00 iters/s

running (0m30.0s), 001/150 VUs, 8993 complete and 0 interrupted iterations
single_api   [  50% ] 001/150 VUs  0m30.0s/1m0s  300.00 iters/s

running (0m31.0s), 001/150 VUs, 9293 complete and 0 interrupted iterations
single_api   [  52% ] 001/150 VUs  0m31.0s/1m0s  300.00 iters/s

running (0m32.0s), 001/150 VUs, 9593 complete and 0 interrupted iterations
single_api   [  53% ] 001/150 VUs  0m32.0s/1m0s  300.00 iters/s

running (0m33.0s), 001/150 VUs, 9893 complete and 0 interrupted iterations
single_api   [  55% ] 001/150 VUs  0m33.0s/1m0s  300.00 iters/s

running (0m34.0s), 001/150 VUs, 10193 complete and 0 interrupted iterations
single_api   [  57% ] 001/150 VUs  0m34.0s/1m0s  300.00 iters/s

running (0m35.0s), 001/150 VUs, 10493 complete and 0 interrupted iterations
single_api   [  58% ] 001/150 VUs  0m35.0s/1m0s  300.00 iters/s

running (0m36.0s), 001/150 VUs, 10793 complete and 0 interrupted iterations
single_api   [  60% ] 001/150 VUs  0m36.0s/1m0s  300.00 iters/s

running (0m37.0s), 001/150 VUs, 11093 complete and 0 interrupted iterations
single_api   [  62% ] 001/150 VUs  0m37.0s/1m0s  300.00 iters/s

running (0m38.0s), 001/150 VUs, 11393 complete and 0 interrupted iterations
single_api   [  63% ] 001/150 VUs  0m38.0s/1m0s  300.00 iters/s

running (0m39.0s), 001/150 VUs, 11693 complete and 0 interrupted iterations
single_api   [  65% ] 001/150 VUs  0m39.0s/1m0s  300.00 iters/s

running (0m40.0s), 001/150 VUs, 11993 complete and 0 interrupted iterations
single_api   [  67% ] 001/150 VUs  0m40.0s/1m0s  300.00 iters/s

running (0m41.0s), 001/150 VUs, 12293 complete and 0 interrupted iterations
single_api   [  68% ] 001/150 VUs  0m41.0s/1m0s  300.00 iters/s

running (0m42.0s), 001/150 VUs, 12593 complete and 0 interrupted iterations
single_api   [  70% ] 001/150 VUs  0m42.0s/1m0s  300.00 iters/s

running (0m43.0s), 001/150 VUs, 12893 complete and 0 interrupted iterations
single_api   [  72% ] 001/150 VUs  0m43.0s/1m0s  300.00 iters/s

running (0m44.0s), 001/150 VUs, 13193 complete and 0 interrupted iterations
single_api   [  73% ] 001/150 VUs  0m44.0s/1m0s  300.00 iters/s

running (0m45.0s), 001/150 VUs, 13493 complete and 0 interrupted iterations
single_api   [  75% ] 001/150 VUs  0m45.0s/1m0s  300.00 iters/s

running (0m46.0s), 001/150 VUs, 13793 complete and 0 interrupted iterations
single_api   [  77% ] 001/150 VUs  0m46.0s/1m0s  300.00 iters/s

running (0m47.0s), 001/150 VUs, 14093 complete and 0 interrupted iterations
single_api   [  78% ] 001/150 VUs  0m47.0s/1m0s  300.00 iters/s

running (0m48.0s), 001/150 VUs, 14393 complete and 0 interrupted iterations
single_api   [  80% ] 001/150 VUs  0m48.0s/1m0s  300.00 iters/s

running (0m49.0s), 001/150 VUs, 14693 complete and 0 interrupted iterations
single_api   [  82% ] 001/150 VUs  0m49.0s/1m0s  300.00 iters/s

running (0m50.0s), 001/150 VUs, 14993 complete and 0 interrupted iterations
single_api   [  83% ] 001/150 VUs  0m50.0s/1m0s  300.00 iters/s

running (0m51.0s), 001/150 VUs, 15293 complete and 0 interrupted iterations
single_api   [  85% ] 001/150 VUs  0m51.0s/1m0s  300.00 iters/s

running (0m52.0s), 001/150 VUs, 15593 complete and 0 interrupted iterations
single_api   [  87% ] 001/150 VUs  0m52.0s/1m0s  300.00 iters/s

running (0m53.0s), 001/150 VUs, 15893 complete and 0 interrupted iterations
single_api   [  88% ] 001/150 VUs  0m53.0s/1m0s  300.00 iters/s

running (0m54.0s), 001/150 VUs, 16193 complete and 0 interrupted iterations
single_api   [  90% ] 001/150 VUs  0m54.0s/1m0s  300.00 iters/s

running (0m55.0s), 001/150 VUs, 16493 complete and 0 interrupted iterations
single_api   [  92% ] 001/150 VUs  0m55.0s/1m0s  300.00 iters/s

running (0m56.0s), 001/150 VUs, 16793 complete and 0 interrupted iterations
single_api   [  93% ] 001/150 VUs  0m56.0s/1m0s  300.00 iters/s

running (0m57.0s), 001/150 VUs, 17093 complete and 0 interrupted iterations
single_api   [  95% ] 001/150 VUs  0m57.0s/1m0s  300.00 iters/s

running (0m58.0s), 001/150 VUs, 17393 complete and 0 interrupted iterations
single_api   [  97% ] 001/150 VUs  0m58.0s/1m0s  300.00 iters/s

running (0m59.0s), 001/150 VUs, 17693 complete and 0 interrupted iterations
single_api   [  98% ] 001/150 VUs  0m59.0s/1m0s  300.00 iters/s

running (1m00.0s), 001/150 VUs, 17993 complete and 0 interrupted iterations
single_api   [ 100% ] 001/150 VUs  1m00.0s/1m0s  300.00 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=3.66ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 18001   299.997782/s
    checks_succeeded...: 100.00% 18001 out of 18001
    checks_failed......: 0.00%   0 out of 18001

    ✓ iam_profile_update status

    HTTP
    http_req_duration..............: avg=3.15ms min=2.1ms  med=2.85ms max=283.11ms p(90)=3.27ms p(95)=3.66ms
      { expected_response:true }...: avg=3.15ms min=2.1ms  med=2.85ms max=283.11ms p(90)=3.27ms p(95)=3.66ms
    http_req_failed................: 0.00%  0 out of 18001
    http_reqs......................: 18001  299.997782/s

    EXECUTION
    iteration_duration.............: avg=3.32ms min=2.23ms med=3.03ms max=283.27ms p(90)=3.49ms p(95)=3.92ms
    iterations.....................: 18001  299.997782/s
    vus............................: 1      min=1          max=2  
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 5.6 MB 94 kB/s
    data_sent......................: 4.4 MB 73 kB/s



running (1m00.0s), 000/150 VUs, 18001 complete and 0 interrupted iterations
single_api ✓ [ 100% ] 000/150 VUs  1m0s  300.00 iters/s